Tekla Open API Reference for Tekla Structures 2025
SymbolAttributes Properties
The Symbol.SymbolAttributes type exposes the following members.
Properties
Name | Description
Angle
 The angle of the symbol. Cannot be changed for an editor-created symbol when the symbol is created "along line".
Color
 The symbol color. Does not have an effect on symbols where the color is already defined in the symbol file.
Frame
 The frame for the symbol.
Height
 The height of the symbol.
PreferredPlacing
 The type of placing the object should use. See the preferred placing types for different types of placing.
TrueColor
 The true color (RGB enabled) of the symbol. Does not have an effect on symbols where the color is already defined in the symbol file.
Top
See Also
Reference
Symbol.SymbolAttributes Class
Tekla.Structures.Drawing Namespace